bmons-site/app/controllers/alert_logs_controller.rb

  def index
    #getting logs only that belong to current user account
    alerts = Alert.where(user_id: current_user.id)
---
SELECT "alerts".* FROM "alerts" WHERE "alerts"."user_id" = $1  [["user_id", 3]]