bmons-site/app/controllers/alerts_controller.rb

SELECT "alerts".* FROM "alerts" WHERE "alerts"."user_id" = $1  [["user_id", 3]]
---
  def index
    @alerts = Alert.where(user_id: current_user.id)