bmons-site/app/controllers/beehives_controller.rb

SELECT "beehives".* FROM "beehives" WHERE "beehives"."user_id" = $1  [["user_id", 3]]
---
  def index
    @beehives = Beehive.where(user_id: current_user.id)