bmons-site/app/controllers/beehives_controller.rb

  def index
    @beehives = Beehive.all
---
SELECT "beehives".* FROM "beehives"

  def create
    @beehive = Beehive.new(beehive_params)
    @beehive.user_id = current_user.id
    respond_to do |format|
      if @beehive.save
---
INSERT INTO "beehives" ("name", "position", "mode", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "abc"], ["position", "N11S12"], ["mode", 0], ["user_id", 0], ["created_at", "2015-03-10 14:09:09.663877"], ["updated_at", "2015-03-10 14:09:09.663877"]]

  def destroy
    @beehive.destroy
---
DELETE FROM "beehives" WHERE "beehives"."id" = $1  [["id", 3]]

    def set_beehive
      @beehive = Beehive.find(params[:id])
---
SELECT  "beehives".* FROM "beehives" WHERE "beehives"."id" = $1 LIMIT 1  [["id", 3]]