bmons-site/app/controllers/main_controller.rb

  def index
    colors = ["#C60800","#FCD21C","#2222ff","#16B84E","#DFAF2C"]

    @beehives = Beehive.where(user_id: current_user.id)
    @data = Array.new()
    @dataString = "["
    @beehives.each do |beehive|
      str = "["
      c = 0
      beehive.sensors.each do |sensor|

        str = str + "{ key: \"#{sensor.name} (#{sensor.unity})\", color: \"#{colors[c]}\", values: [ "
        #to-do / improvement: limit amount of measurements
        sensor.measurements.each do |measurement|
---
SELECT "beehives".* FROM "beehives" WHERE "beehives"."user_id" = $1  [["user_id", 3]]
SELECT "sensors".* FROM "sensors" WHERE "sensors"."beehive_id" = $1  [["beehive_id", 3]]
SELECT "measurements".* FROM "measurements" WHERE "measurements"."sensor_id" = $1  [["sensor_id", 10]]