bmons-site/app/controllers/measurements_controller.rb

SELECT "beehives".* FROM "beehives" WHERE "beehives"."user_id" = $1  [["user_id", 3]]
SELECT "sensors".* FROM "sensors" WHERE "sensors"."beehive_id" = $1  [["beehive_id", 3]]
---
  def index
    #getting measurements only that belong to current user account
    beehives = Beehive.where(user_id: current_user.id)
    @measurements = Array.new
    beehives.each do |beehive|
      beehive.sensors.each do |sensor|