bmons-site/app/controllers/sensors_controller.rb

SELECT "beehives".* FROM "beehives" WHERE "beehives"."user_id" = $1  [["user_id", 3]]
---
  def index
    #getting sensors only that belong to current user account
    beehives = Beehive.where(user_id: current_user.id)