bmons-site/app/controllers/sensors_controller.rb

  def index
    @sensors = Sensor.all
---
SELECT "sensors".* FROM "sensors"

  def create
    @sensor = Sensor.new(sensor_params)
		#render @sensor.beehive_id
		#render plain: params[:sensor].inspect
    respond_to do |format|
      if @sensor.save
---
INSERT INTO "sensors" ("name", "type", "unity", "beehive_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "abc"], ["type", "temperature"], ["unity", "c"], ["beehive_id", 1], ["created_at", "2015-03-10 12:45:09.910800"], ["updated_at", "2015-03-10 12:45:09.910800"]]