bmons-site/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    return unless current_user.access_level == 99
    @users = User.all

INSERT INTO "users" ("name", "access_level", "login", "password", "email", "tel", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
  def destroy
    return unless current_user.access_level == 99
    @user.destroy