bmons-site/app/views/beehives/show.html.erb

SELECT "sensors".* FROM "sensors" WHERE "sensors"."beehive_id" = $1  [["beehive_id", 4]]
---
  <tbody>
    <% @beehive.sensors.each do |sensor| %>

SELECT "measurements".* FROM "measurements" WHERE "measurements"."sensor_id" = $1  [["sensor_id", 10]]
---
    <% @beehive.sensors.each do |sensor| %>
      <% sensor.measurements.each do |measurement| %>